create table tran_table (
	company_id INT,
	acc_numb VARCHAR(50),
	tran_dttm TIMESTAMP,
	tran_sum INT,
	tran_nazn VARCHAR(128)
);
insert into tran_table(company_id, acc_numb, tran_dttm, tran_sum, tran_nazn) values
(1, 444444401, '2021-05-10 10:00',18234, 'НДС не облагается'),
(1, 444444402, '2021-05-10 10:40', 100300, 'Перевод на свою карту'),
(2, 444444440, '2021-05-18 10:40', 2000, 'ЗП'),
(3, 444444439, '2021-04-18 20:10', 50031, 'платеж по зарплате'),
(2, 444444440, '2021-04-19 15:03', 12335, 'перевод зарплаты'),
(4, 444444488, '2021-03-20 18:26', 1327, 'ЗАРПЛАТА ЗА ПЕРИОД'),
(5, 444444433, '2021-04-21 22:00', 23452, 'оплата по договору'),
(1, 444444401, '2021-03-01 23:48', 42367, 'налог'),
(1, 444444402, '2021-05-23 21:00', 23467, 'перевод на карту'),
(2, 444444402, '2024-11-23 21:00', 212000, 'платеж по зарплате'),
(3, 444444401, '2024-12-25 12:00', 200111, 'ЗП');